{
    "name": "ClusterGCNConv",
    "description": "The ClusterGCN graph convolutional operator from the \"Cluster-GCN: An Efficient Algorithm for Training Deep and Large Graph Convolutional Networks\" paper.",
    "link": "../generated/torch_geometric.nn.conv.ClusterGCNConv.html#torch_geometric.nn.conv.ClusterGCNConv",
    "paper_link": "https://arxiv.org/abs/1905.07953",
    "paper_name": "\"Cluster-GCN: An Efficient Algorithm for Training Deep and Large Graph Convolutional Networks\"",
    "Local Paper PDF Path": "knowledge_base\\pyg_info\\nn\\ClusterGCNConv.pdf",
    "Paper Summary": "{    'GNN_Design': {        'agg_ops': 'Graph clustering-based aggregation that focuses on within-cluster links for higher embedding utilization.',        'skip_connections': 'Not explicitly described in the provided text.',        'layer_info_fusion': 'Clusters are used to decompose the graph allowing for efficient information aggregations and dense subgraph sampling.',        'num_layers': 'Tested with architectures ranging from 2-layer to 8-layer designs.',        'hyperparameters': 'Batch size is variable; e.g., 512 units on VR-GCN, clusters per batch are stated as hyperparameters such as 1,200 for Reddit.',        'activation': 'ReLU activation function is used as the default activation in the architecture.'    },    'Experimental_Setup': {        'datasets': ['PPI', 'Reddit', 'Amazon', 'Amazon2M'],        'dataset_summary': 'PPI contains 56,944 nodes and is for multi-label classification. Reddit has 232,965 nodes for multi-class classification. Amazon and its larger variant Amazon2M are used for multi-label and multi-class classification respectively, with Amazon2M being significantly larger with 2 million nodes.',        'baseline': [            'VR-GCN, using variance reduction techniques',            'GraphSAGE, based on fixed-size neighborhood sampling'        ],        'performance_comparisons': {            'PPI': 'Cluster-GCN achieves state-of-the-art F1 score of 99.36 compared to the previous best of 98.71 by other methods such as GaAN.',            'Reddit': 'Cluster-GCN achieves a F1 score of 96.60, compared with up to 96.36 by VR-GCN.',            'Amazon2M': 'Cluster-GCN outperforms in terms of memory usage and scalability; capable of training with 4-layer GCN architecture while VR-GCN runs out of memory.',        }    }}"
}