{
    "name": "GENConv",
    "description": "The GENeralized Graph Convolution (GENConv) from the \"DeeperGCN: All You Need to Train Deeper GCNs\" paper.",
    "link": "../generated/torch_geometric.nn.conv.GENConv.html#torch_geometric.nn.conv.GENConv",
    "paper_link": "https://arxiv.org/abs/2006.07739",
    "paper_name": "\"DeeperGCN: All You Need to Train Deeper GCNs\"",
    "Local Paper PDF Path": "knowledge_base\\pyg_info\\nn\\GENConv.pdf",
    "Paper Summary": "{    \"GNN_Design\": {        \"agg_ops\": \"Proposed a novel Generalized Aggregation Function covering mean, max, and provides a learnable interpolation between them. Utilized SoftMax_Agg and PowerMean_Agg as aggregation functions with parameters β and p.\",        \"skip_connections\": \"Introduced pre-activation residual connections, which follow the ordering: Normalization → ReLU → GraphConv → Addition, shown to perform better than post-activation.\",        \"layer_info_fusion\": \"Fusion of information across layers is enhanced using permutation-invariant generalized aggregation functions and message normalization.\",        \"num_layers\": \"The architecture supports very deep networks, with experiments running up to 112 layers.\",        \"hyperparameters\": \"Different values of β such as 10^n where n ∈ {-3, -2, -1, 0, 1, 2, 3, 4} and p ∈ {-1, 10^-3, 1, 2, 3, 4, 5} were explored. Dynamic learning of β and p demonstrated improvements.\",        \"activation\": \"ReLU activation used consistently across layers, with additional layer and message normalizations applied.\"    },    \"Experimental_Setup\": {        \"datasets\": \"The experiments were conducted on four datasets from the Open Graph Benchmark (OGB): ogbn-proteins, ogbn-arxiv, ogbg-ppa, and ogbg-molhiv.\",        \"dataset_summary\": {            \"ogbn-proteins\": \"Undirected, weighted graph with 132,534 nodes and 39,561,252 edges, predicting multi-label protein properties.\",            \"ogbn-arxiv\": \"Directed citation network with 169,343 nodes and 1,166,243 edges for multi-class node classification.\",            \"ogbg-ppa\": \"Dataset of 158,100 densely connected biological subgraphs for multi-class classification.\",            \"ogbg-molhiv\": \"Consists of 41,127 molecular graphs for binary classification of molecular properties.\"        },        \"baseline\": \"Baseline comparison with models like GCN, GraphSAGE, GIN, GaAN, and GatedGCN.\",        \"performance_comparisons\": \"The proposed method significantly outperformed SOTA by 7.8% on ogbn-proteins, 0.2% on ogbn-arxiv, 6.7% on ogbg-ppa, and 0.9% on ogbg-molhiv.\"    }}"
}