{
    "name": "GravNetConv",
    "description": "The GravNet operator from the \"Learning Representations of Irregular Particle-detector Geometry with Distance-weighted Graph Networks\" paper, where the graph is dynamically constructed using nearest neighbors.",
    "link": "../generated/torch_geometric.nn.conv.GravNetConv.html#torch_geometric.nn.conv.GravNetConv",
    "paper_link": "https://arxiv.org/abs/1902.07987",
    "paper_name": "\"Learning Representations of Irregular Particle-detector Geometry with Distance-weighted Graph Networks\"",
    "Local Paper PDF Path": "knowledge_base\\pyg_info\\nn\\GravNetConv.pdf",
    "Paper Summary": "{    \"GNN_Design\": {        \"agg_ops\": \"GravNet uses a Gaussian potential V(d) = exp(−d^2) and GarNet uses an exponential potential V(d) = exp(−|d|) for aggregation.\",        \"skip_connections\": \"Output of each block is passed to the next block and simultaneously added to a list of all block outputs.\",        \"layer_info_fusion\": \"Each layer's output is concatenated and processed by a dense layer with tanh activation for GravNet and ReLU for GarNet.\",        \"num_layers\": \"GravNet uses four blocks; GarNet uses 11 layers.\",        \"hyperparameters\": \"GravNet: 40 neighbors in S=4 dimensions; GarNet: S=4 aggregators, F_LR=20, F_OUT=32.\",        \"activation\": \"GravNet uses tanh and ReLU activations; GarNet uses tanh and ReLU activations.\"    },    \"Experimental_Setup\": {        \"datasets\": \"Simulated data of pion interactions in a toy calorimeter model.\",        \"dataset_summary\": \"Calorimeter has irregular geometry, 20 layers, charged pions with energy 10-100 GeV simulate showers.\",        \"baseline\": \"Comparison with Binning (CNN approach) and DGCNN models.\",        \"performance_comparisons\": \"GravNet outperforms other models in terms of accuracy. GarNet performs better in specific metrics than Binning but worse than DGCNN. GarNet shows optimal resource usage in terms of memory and inference time.\"    }}"
}