{
    "name": "HANConv",
    "description": "The Heterogenous Graph Attention Operator from the \"Heterogenous Graph Attention Network\" paper.",
    "link": "../generated/torch_geometric.nn.conv.HANConv.html#torch_geometric.nn.conv.HANConv",
    "paper_link": "https://arxiv.org/abs/1903.07293",
    "paper_name": "\"Heterogenous Graph Attention Network\"",
    "Local Paper PDF Path": "knowledge_base\\pyg_info\\nn\\HANConv.pdf",
    "Paper Summary": "{    \"GNN_Design\": {        \"agg_ops\": \"Node-level attention to learn importance of meta-path based neighbors and semantic-level attention to weight different meta-paths.\",        \"skip_connections\": \"Not specifically mentioned.\",        \"layer_info_fusion\": \"Hierarchical structure where node-level attention is followed by semantic-level attention, enabling information fusion across meta-paths.\",        \"num_layers\": \"It employs a two-layer hierarchical attention mechanism.\",        \"hyperparameters\": \"Learning rate: 0.005, regularization parameter: 0.001, dimension of attention vector: 128, number of attention heads: 8, dropout rate: 0.6.\",        \"activation\": \"Uses the activation function denoted by σ in the attention mechanisms.\"    },    \"Experimental_Setup\": {        \"datasets\": \"DBLP, ACM, IMDB\",        \"dataset_summary\": {            \"DBLP\": \"Consists of 14328 papers, 4057 authors, 20 conferences, 8789 terms with the authors divided into four research areas. Meta-paths: APA, APCPA, APTPA.\",            \"ACM\": \"Includes papers published in specific conferences divided into three classes. Meta-paths: PAP, PSP.\",            \"IMDB\": \"Contains 4780 movies, 5841 actors, and 2269 directors with movies categorized into Action, Comedy, Drama. Meta-paths: MAM, MDM.\"        },        \"baseline\": \"DeepWalk, ESim, metapath2vec, HERec, GCN, GAT\",        \"performance_comparisons\": {            \"classification\": \"HAN consistently outperformed all baselines on classification tasks across all datasets, demonstrating significant improvements especially over GCN and GAT.\",            \"clustering\": \"HAN showed superior clustering performance, indicating better feature extraction capabilities in terms of NMI and ARI metrics.\"        }    }}"
}