{
    "name": "ResGatedGraphConv",
    "description": "The residual gated graph convolutional operator from the \"Residual Gated Graph ConvNets\" paper.",
    "link": "../generated/torch_geometric.nn.conv.ResGatedGraphConv.html#torch_geometric.nn.conv.ResGatedGraphConv",
    "paper_link": "https://arxiv.org/abs/1711.07553",
    "paper_name": "\"Residual Gated Graph ConvNets\"",
    "Local Paper PDF Path": "knowledge_base\\pyg_info\\nn\\ResGatedGraphConv.pdf",
    "Paper Summary": "{    \"GNN_Design\": {        \"agg_ops\": \"Gated edges and residual connections are used with aggregation based on the neighborhood feature vectors. The graph ConvNet model uses Relu activations with learnable parameters (U, V) for aggregating information.\",        \"skip_connections\": \"Residual connections are employed as per ResNets to improve layer stacking and accuracy, particularly beneficial when stacking more than six layers.\",        \"layer_info_fusion\": \"Graph ConvNet uses both the feature vector of the center vertex and its neighbors to update the layer information through aggregation functions.\",        \"num_layers\": \"Experiments vary the number of layers with some experiments fixed at L = 6. Depths range from shallow single-layer networks to deeper up to L = 10.\",        \"hyperparameters\": \"For graph ConvNets, the budget is set to a fixed B = 100K with hidden neurons auto-computed. Learning schedule includes 5,000 maximum iterations with a learning rate dynamically adjusted.\",        \"activation\": \"Rectified Linear Unit (ReLU) is used as the activation function in graph ConvNets, facilitating non-linear transformations.\"    },    \"Experimental_Setup\": {        \"datasets\": \"Synthetic datasets include subgraph matching graphs and semi-supervised clustering graphs, both generated using a stochastic block model for vertex and edge assignment.\",        \"dataset_summary\": \"Subgraph matching tasks involve random graphs with community structures and uniform random distributed vertex signals. Clustering tasks focus on identifying communities given one label per community.\",        \"baseline\": \"Baselines include existing works such as Gated Graph Neural Networks by Li et al. (2016), CommNets by Sukhbaatar et al. (2016), and Syntactic Nets by Marcheggiani & Titov (2017). A non-learning variational method is also compared.\",        \"performance_comparisons\": \"Gated graph ConvNets outperform RNN architectures, providing 3-17% increased accuracy and gaining substantial speed (1.5-4x faster). The proposed model achieves up to 36% more accuracy compared to variational methods in clustering tasks.\"    }}"
}