{
    "name": "SGConv",
    "description": "The simple graph convolutional operator from the \"Simplifying Graph Convolutional Networks\" paper.",
    "link": "../generated/torch_geometric.nn.conv.SGConv.html#torch_geometric.nn.conv.SGConv",
    "paper_link": "https://arxiv.org/abs/1902.07153",
    "paper_name": "\"Simplifying Graph Convolutional Networks\"",
    "Local Paper PDF Path": "knowledge_base\\pyg_info\\nn\\SGConv.pdf",
    "Paper Summary": "{    \"GNN_Design\": {        \"agg_ops\": \"SGC collapses the weight matrices between consecutive layers and removes intermediate nonlinearities, utilizing only the final softmax for probabilistic outputs. The design effectively simplifies the aggregation operation to a fixed feature propagation step.\",        \"skip_connections\": \"No specific skip-connection designs are mentioned in the SGC model.\",        \"layer_info_fusion\": \"Information is fused across layers by collapsing them into a single K-step propagation of node features, which equates to raising the adjacency matrix to the K-th power.\",        \"num_layers\": \"SGC conceptually reduces the model to a single linear transformation following K-step feature propagation, effectively having one 'layer.'\",        \"hyperparameters\": \"Hyperparameters include the degrees of the propagation matrix (K), weight decay for regularization, and a learning rate optimized per dataset.\",        \"activation\": \"ReLU is used in GCN layers, but SGC replaces this with a single softmax after fixed feature extraction.\"    },    \"Experimental_Setup\": {        \"datasets\": [            \"Cora, Citeseer, and Pubmed citation networks\",            \"Reddit dataset for massive scale graph evaluation\"        ],        \"dataset_summary\": {            \"Cora\": \"A citation network containing 2,708 nodes and 5,429 edges.\",            \"Citeseer\": \"A citation dataset with 3,327 nodes and 4,732 edges.\",            \"Pubmed\": \"Contains 19,717 nodes and 44,338 edges with a larger scale than Cora and Citeseer.\",            \"Reddit\": \"A large-scale dataset with 233K nodes and 11.6M edges used for inductive node classification.\"        },        \"baseline\": [            \"GCN, GAT, FastGCN, DeepWalk, GraphSAGE (mean, LSTM, GCN variants)\",            \"Attention-based models like GaAN and others such as LNet, AdaLNet\"        ],        \"performance_comparisons\": \"SGC achieves comparable or superior performance to other state-of-the-art models in many tasks, with significant improvements in computation time – up to two orders of magnitude faster on large datasets like Reddit.\"    }}"
}