{
    "name": "SignedConv",
    "description": "The signed graph convolutional operator from the \"Signed Graph Convolutional Network\" paper.",
    "link": "../generated/torch_geometric.nn.conv.SignedConv.html#torch_geometric.nn.conv.SignedConv",
    "paper_link": "https://arxiv.org/abs/1808.06354",
    "paper_name": "\"Signed Graph Convolutional Network\"",
    "Local Paper PDF Path": "knowledge_base\\pyg_info\\nn\\SignedConv.pdf",
    "Paper Summary": "{    'GNN_Design': {        'agg_ops': 'The SGCN utilizes a convolutional operator based on balance theory to aggregate information from balanced and unbalanced paths distinctly. Specifically, it makes use of separate aggregation functions for balanced (suggested friends) and unbalanced (suggested enemies) paths.',        'skip_connections': 'The design did not explicitly mention skip connections between layers.',        'layer_info_fusion': 'Information is fused across layers by separately aggregating from positive and negative links at each layer, and then combining these computations based on balance theory to form a coherent embedding.',        'num_layers': 'Various layers used in experiments including SGCN-1 (1 layer), SGCN-1+ (1 layer with double propagation), and SGCN-2 (2 layers).',        'hyperparameters': 'Embeddings of size 64, with hidden dimensions for each aspect (friends and enemies) set to 32. Parameter λ in the objective controls the contribution of balance theory terms, tuned to λ=5.',        'activation': 'Non-linear activation function (σ) used in aggregations, though specific type not explicitly stated.'    },    'Experimental_Setup': {        'datasets': 'Bitcoin-Alpha, Bitcoin-OTC, Slashdot, Epinions',        'dataset_summary': 'Bitcoin-Alpha and Bitcoin-OTC contain user trust ratings from Bitcoin marketplaces, while Slashdot and Epinions have friend and foe trust networks.',        'baseline': 'Comparison made against unsigned spectral embedding (SSE), deep-learning based SiNE, and random-walk-based SIDE methods.',        'performance_comparisons': \"SGCN generally outperformed baselines like SiNE and SSE. SGCN-2 often showed improvement over simpler versions like SGCN-1 and SGCN-1+, with the incorporation of balance theory providing substantial gains, particularly evident in metrics like AUC and F1 scores on link sign prediction tasks.\"    }}"
}